"StartAllServers" = "Start Servers";
"StopAllServers" = "Stop Servers";
"wrongFolderAlertHeadline" = "MAMP couldn't be started!";
"wrongFolderAlertText" = "The MAMP folder must be located directly in the Applications folder.";
"ok" = "OK";
"language" = "English";
"isoLanguage" = "en";
"tourLanguage" = "en";

"key_sorry" = "Sorry";
"key_osTooLow" = "macOS 10.12 (Sierra) or higher is required in order to run MAMP.";

"key_<none>" = "none selected";

"mysqlTool_titleUpgrade" = "Upgrade MySQL Databases…";
"mysqlTool_titleRepair" = "Repair MySQL Databases…";
"mysqlTool_titleCheck" = "Check MySQL Databases…";
"mysqlTool_messageUpgrade" = "Please backup your databases before performing an upgrade!";
"mysqlTool_messageRepair" = "Please backup your databases before trying to repair!";
"mysqlTool_messageCheck" = "This function checks the database tables for errors and for a possible need to upgrade.";
"mysqlTool_doItUpgrade" = "Upgrade";
"mysqlTool_doItRepair" = "Repair";
"mysqlTool_doItCheck" = "Check";
"mysqlTool_done" = "Cancel";
"mysqlTool_statusFailed" = "Failed";

"mysqlQuickCheck_dontShow" = "Don't show it again!";
"mysqlQuickCheck_NeedsUpgradeTitle" = "The MySQL databases need to be upgraded.";
"mysqlQuickCheck_NeedsUpgradeMsg" ="You should upgrade your MySQL databases as soon as possible using the menu 'Tools → Upgrade MySQL databases'. If you click 'OK' this function opens automatically.";
"mysqlQuickCheck_NeedsUpgradeErrorTitle" = "Checking the MySQL databases failed.";
"mysqlQuickCheck_NeedsUpgradeErrorMsgFormat" = "Error message:\n\n%@";

"ChooseDocRootTitle" = "Please select a Document Root folder:";
"Select" = "Choose";
"Preferences" = "Preferences…";
"key_PreferencesCouldNotBeSaved" = "The preferences could be saved!";

"httpServerNameApache" = "Apache Server";
"httpServerNameNginx" = "Nginx Server";

"error" = "Error";
"portInUse" = "%@ couldn't be started because port %@ is in use by some other software.";
"couldntStartServer" = "%@ couldn't be started. Please check your MAMP installation and configuration.";
"noDocumentRoot" = "Please assign a Document Root to your web server.";
"problemWithPort" = "There is a problem with the %@ port. Please check your configuration, the port must be in the range from %@ to 65535.";
"duplicatePorts" = "There is a problem with the server ports. Each server must be assigned a unique port. Please check your configuration.";
"docRootMissing" = "The document root seems to be missing, please check the preferences.";
"extLibInitFailed" = "A library could not be initialized.\n\nPlease make sure your installation is complete, or re-install if necessary.";

"TourOfMampPro" = "Discover MAMP PRO";

"ThankYou" = "Thank you!";
"ThankYouInfo" = "Thank you for taking the time to support our efforts to improve MAMP! We really appreciate your help.";

"key_UpdateMAMPTitle" = "MAMP Update";
"key_LearnMore" = "Learn More";
"key_UpdateInformativeText" = "MAMP %@ is now available. You can check the new features and download the new version by clicking on 'Learn More'.";
"key_UpdateSuppressionButtonTitle" = "Ignore this version";

"key_EncryptionFailure" = "Please restart MAMP and try again. If this message persists, you must reinstall MAMP.";
"key_MamphelperObjectConnectionFailure" = "Please restart MAMP and try again. If this message keeps showing up, please reinstall MAMP.";

"key_Yes" = "Yes";
"key_No" = "No";
"key_Retry" = "Retry";
"key_CloudLoginFailed" = "Login failed!";
"key_MaybeWrongCredentials" = "Maybe you provided an incorrect user name or password?";
"key_CloudDemoStartFailed" = "Cloud demo could not be started!";
"key_CloudDemoStartFailedMsg" = "An error occurred while starting your Cloud demo.";

"key_SavingToCloud" = "Saving to Cloud";
"key_SavingToCloudFormat" = "Saving to %@";
"key_LoadingFromCloud" = "Loading from Cloud";
"key_LoadingFromCloudFormat" = "Loading from %@";
"key_PreparingSaveToCloud" = "Preparing save to cloud…";
"key_PreparingSaveToCloudFormat" = "Preparing save to %@…";
"key_PreparingLoadFromCloud" = "Preparing load from cloud…";
"key_PreparingLoadFromCloudFormat" = "Preparing load from %@…";
"key_UploadingToCloud" = "Uploading to Cloud…";
"key_UploadingToCloudFormat" = "Uploading to %@…";
"key_DownloadingFromCloud" = "Downloading from Cloud…";
"key_DownloadingFromCloudFormat" = "Downloading from %@…";

"key_CompressingDocumentRoot" = "Compressing document root folder…";
"key_DecompressingDocumentRoot" = "Decompressing document root folder…";
"key_DecompressingArchive" = "Decompressing archive…";
"key_CheckingArchive" = "Checking archive version…";
"key_SavingMySqlData" = "Saving MySQL data…";
"key_LoadingMySqlData" = "Loading MySQL data…";
"key_CompressingMySqlData" = "Compressing MySQL data…";
"key_DecompressingMySqlData" = "Decompressing MySQL data…";
"key_MySQLNotRunning" = "MySQL is not running!";
"key_CreatingArchive" = "Creating archive…";
"key_EncryptingArchive" = "Encrypting archive…";
"key_DecryptingArchive" = "Decrypting archive…";
"key_CloudActivatingSettings" = "Activating settings…";
"key_CloudCopyingDocumentRoot" = "Copying document root data…";
"key_CloudCleaningUp" = "Cleaning up…";
"key_CloudActionCompleted" = "Completed!";
"key_CloudStartTransferring" = "Preparing data transfer…";
"key_CloudStopTransferring" = "Cleaning up after data transfer…";
"key_PreparingNextStep" = "Preparing next step…";
"key_CloudLoadingData" = "Transferring data";
"key_CloudLoadingDataFormat" = "Transferring data: %.f%@ of %.f%@…";
"key_CloudUpoadingDataFormat" = "Uploading data: %.f%@ of %.f%@…";
"key_CloudDownloadingDataFormat" = "Downloading data: %.f%@ of %.f%@…";

"key_CouldNotEncryptHostData" = "The data could not be encrypted.";
"key_CouldNotDecryptHostData" = "The data could not be decrypted.";
"key_CouldNotValidateArchive" = "The archive format is incompatible with this version of MAMP.";
"key_CouldNotImportDatabaseUser" = "The user for accessing the database could not be created.";
"key_CouldNotExportDatabaseUser" = "No database user could be found. Maybe no user has explicit permissions to access the database.";
"key_CouldNotReadHostSettings" = "The hosts settings could not be read correctly.";
"key_CouldNotMoveDocumentRootToItsPlace" = "The document root folder could not be moved to its destination!";
"key_CouldNotImportDatabase" = "The MySQL data could not be imported.";
"key_CouldNotExportDatabase" = "The MySQL data could not be exported.";
"key_CouldNotZipArchive" = "The data could not be compressed.";
"key_CouldNotUnzipArchive" = "The data could not be unpacked.";
"key_CouldNotDownloadData" = "The data could not be downloaded from the Cloud.";
"key_CouldNotDownloadDataFormat" = "The data could not be downloaded from %@.";
"key_CouldNotUploadData" = "The data could not be uploaded to the Cloud.";
"key_CouldNotUploadDataFormat" = "The data could not be uploaded to %@.";

"key_CloudEmailFormat" = "Account: %@";
"key_CloudFreeSpaceFormat" = "Free space: %@";
"key_CloudUnlimitedStorage" = "unlimited";

"key_AskForCloudUploadInSpiteUnknownFreeSpace" = "The amount of free space could not be determined, do you want to continue nonetheless?";
"key_AskForCloudUploadInSpiteInsufficientFreeSpace" = "The amount of free space may be insufficient to store this amount of data, do you want to continue nonetheless?";
"key_AskForCloudUploadInSpiteFreeCloudSpace" = "Don't ask for confirmation again";

"key_AskForCloudDataConfirmation" = "Don't ask for confirmation again if no database is selected";
"key_AskForCloudDataConfirmationTitle" = "You have NO database selected. Are you sure you want to continue with this setting?";
"key_SelectDB" = "Select database…";

"key_Choose" = "Choose";
"key_ChooseEncryptionKeyFile" = "Please select the encryption key text file:";
"key_MoreToMinimumKeyLengthFormat" = "At least %lu more characters needed!";
"key_MinimumKeyLengthReached" = "Minimum key length reached.";
"key_MoreToPerfectLengthFormat" = "%lu more characters to perfect key length!";
"key_KeyPerfectLength" = "Perfect key length!";
"key_KeyTooLong" = "Key too long!";

"key_NoInternetConnection" = "No internet connection";
"key_Loading" = "Loading…";

"key_SaveToCloud" = "Save to Cloud";
"key_SaveToCloudFormat" = "Save to %@";
"key_LoadFromCloud" = "Load from Cloud";
"key_LoadFromCloudFormat" = "Load from %@";
"key_DeleteDataFromCloud" = "Delete data from Cloud";
"key_DeleteDataFromCloudFormat" = "Delete data from %@";
"key_DeleteFromCloud" = "Delete from Cloud";
"key_DeleteFromCloudFormat" = "Delete from %@";
"key_DeleteFromCloudConfirmation" = "Are you sure you want to delete the archive file from the Cloud?";

"key_SaveToCloudErrorTitle" = "Save to Cloud Error";
"key_SaveToCloudErrorMsg" = "The save to cloud could not be completed. Make sure that you have selected a valid document root and a selected database exists. When encryption is used, confirm that the encryption key exists in the keychain. Otherwise you will have to set a new encryption key.";
"key_LoadFromCloudErrorTitle" = "Load from Cloud Error";
"key_LoadFromCloudErrorMsg" = "The load from cloud could not be completed. Please make sure you have enetered the correct encryption key.";

"key_CloudDemoExpired" = "The Cloud functions demo period has expired. Please register your serial number or purchase a license.";
"key_CloudRegistrationIssue" = "Please make sure you use the correct serial number or contact <support@mamp.info>.";

"key_Delete" = "Delete";
"key_Register" = "Register";
"key_BuyCloudFeature" = "Buy Cloud Functions";
"key_StartDemo" = "Start demo";
"key_DemoStartedTitle" = "Demo Started";
"key_DemoStartedMsg" = "Your Cloud Functions demo period has started! Your demo period will continue for 14 days. Enjoy!";

"key_CloudDemoExpiredTitle" = "Demo Expired";
"key_CloudDemoExpiredMsg" = "The Cloud demo period has expired.";

"key_MC_DemoExpiresInDaysFormat" = "MAMP Cloud Demo - %ld days left";
"key_MP_DemoExpiresInDaysFormat" = "MAMP PRO Demo: %ld days left";
"key_MC_DemoExpiresTomorrow" = "MAMP Cloud Demo expires tomorrow";
"key_MP_DemoExpiresTomorrow" = "MAMP PRO Demo expires tomorrow";
"key_MC_DemoExpiresToday" = "MAMP Cloud Demo will expire today";
"key_MC_DemoExpired" = "MAMP Cloud Demo has expired";
"key_MP_DemoExpiresToday" = "MAMP PRO Demo will expire today";
"key_MP_DemoExpired" = "MAMP PRO Demo has expired";
"key_MP_DemoNotStartedYet" = "Try MAMP PRO now";

"key_CloudServiceOff" = "Off";
"key_CloudServiceOn" = "On";

"key_NoDatabaseAvailable" = "-";

"key_registrationErrorTitle" = "Oops!";
"key_registrationErrorMsg" = "Something went wrong while registering. You need to have Admin rights to register Mamp Cloud. For any other issue, please contact <support@mamp.info>.";
"key_registrationSuccessTitle" = "Registration Successful";
"key_registrationSuccessMsg" = "Thank you for registering a copy of MAMP Cloud Functions!";

"key_buyAlertErrorMsg_Internet" = "Your internet connection appears to be offline.";

"key_CloudFeatureNotRegisterMenuItemTitle" = "Register Cloud";
"key_CloudFeatureAlreadyRegisterMenuItemTitle" = "MAMP Cloud is registered";

"key_StartUsingCloud" = "Start Using Cloud";
"key_StopUsingCloud" = "Stop Using Cloud";
"key_TurnOn" = "Turn On";
"key_TurnOff" = "Turn Off";
"key_CloudDemoIsExpired" = "Demo has expired";
"key_SerialNumber" = "Serial number:";

"key_BuyMampCloudSecure" = "Buy MAMP Cloud %@";
"key_storeDidReceivedErrorTitle" = "Something went wrong.";

"key_storeDidReceivedErrorMsg_StoreError" = "Please check your email for serial number or contact <help@paddle.com>.";
"key_ThankYouPurchaseAlertTitle" = "Thank you for buying MAMP Cloud Functions.";
"key_ThankYouPurchaseAlertMessage_FailGetSerial" = "Thank you for buying MAMP Cloud.\n\nIf you do not receive your registration data via e-mail within the next 30 minutes, please contact <support@mamp.info>.";
"key_ThankYouPurchaseAlertMessage_InstallationOk" = "Thank you for buying MAMP Cloud.\n\nYour registration data has been saved, we have also sent it to you via e-mail. Please keep it in a safe place.";
"key_ThankYouPurchaseAlertMessage_SerialNotOk" = "There was an error with your serial number. Please contact <support@mamp.info> for more information.";

"key_storeMampCloudTitle" = "MAMP Cloud";
"key_storeMampCloudMessage" = "MAMP Cloud is a one-time purchase, the license can also be used with future versions of MAMP.";

"key_MampWantsToStartHelper" = "MAMP needs to launch its helper tool to be able to start and stop servers, change users and use cloud functions.";
"key_MampCouldNotStartHelper" = "MAMP could not start its helper tool with admin rights to complete your request.";
"key_MampCouldNotVerifyHelper" = "MAMP could not verify its helper tool, please re-install";
"key_MampCouldNotInitPhpVersions" = "PHP versions failed to initialize.";
"key_MampCouldNotInitPhpVersionsInfo" = "Please re-install the MAMP package.";

"key_CloudDataDetectedTitle" = "MAMP has found data in the Cloud!";
"key_CloudChangesDetectedTitle" = "There is newer data available in the Cloud!";
"key_CloudChangesDetectedMsg" = "Do you want to load the data from the cloud?";

"key_Cancel" = "Cancel";
"key_Continue" = "Continue";
"key_StepXofYFormat" = "Step %i of %i";
"key_CloudError" = "An error occurred!";
"key_CloudErrorSeeLog" = "Please check the file 'cloud_mamp.log' for reasons of the failure.";
"key_CloudErrorSeeLogFormat" = "%@\n\nPlease check the log file 'cloud_mamp.log' for more information.";
"key_OpenLog" = "Open Log";

"key_UserExistedTitle" = "Database user already exists!";
"key_UserExistedMsg" = "The user needed to access the imported database already exists on this system. This is NOT an error but you should make sure that this user has all the necessary access privileges.";

"key_DeleteFailed" = "Delete failed!";
"key_RestartAndTryAgain" = "Please restart the application and try again!";
"key_TryAgain" = "Please try again!";
"key_CloudStructureInvalid" = "The preferences of MAMP seem to have become corrupted. If this error prevaileds please try re-installing.";
"key_CloudEncryptionKeyMissing" = "The encryption key seems to be missing. Please turn off encryption or re-enter your key.";
"key_CloudEncryptionKeyNotNeeded" = "The file you want to load from cloud does not use encryption. Please, uncheck the Encryption option on your Cloud Settings.";
"key_CloudTmpDirectoryFailed" = "A temporary directory could not be created. Please try again.";
"key_CloudDocumentRootMissing" = "The selected document root folder is missing.";
"key_CouldNotGetPassword4MySQLRoot" = "The password of MySQL user 'root' could not be determined.";
"key_InternalError" = "An internal error occurred. Restart the application and try again.";
"key_CloudDocRootEmptyAndNoDatabase" = "Nothing to save to Cloud: The document root folder is empty and no database is selected.";

"key_DocumentRootNotAllowed" = "MAMP does not allow the selected folder to be used as document root.";
"key_SelectDocumentRootWhyNotUseFormat" = "%@";

"key_AdminAccountRequiredText" = "Administrator account required";
"key_AdminAccountRequiredInfo" = "Sorry, only users with administrator rights can run Mamp.";

"key_Php8Warning" = "You have selected a version of PHP 8!";
"key_Php8WarningInfo" = "PHP 8 is a major update of PHP. It cuts off old pigtails and throws away lots of obsolete code. Therefore, your site may not behave as expected. If this is the case just switch back to an older version of PHP.";
"key_MoreInfo" = "More Info";

"key_CloudAuthorizationSuccessFormat" = "<strong>MAMP</strong> has been successfully authorized with %@.";
"key_CloudAuthorizationFailureFormat" = "Oops, something went wrong. <strong>MAMP</strong> could not be authorized with %@. Please return to the application and try again.";
"key_GoBackToAppButton" = "Return to MAMP";

"key_Discard" = "Discard";
"key_SaveUnsavedChanges" = "There are unsaved changes!";
"key_ChangesLostIfNotSaved" = "The changes will be lost if you don't save them.";

"key_DeleteSelectedRowsFormat" = "Delete selected rows (%lu)?";
"key_UnknownHostFirstContact" = "MAMP PRO doesn't know about this host yet!";
"key_UnknownHostFirstContactInfoFormat" = "If you really want to connect to %@, just 'Continue'.\n\nFingerprint: %@";
"key_UnknownHostUserCancelledFormat" = "You chose to cancel connecting to '%@' (Fingerprint: %@).";
"key_WrongFingerprint" = "Something nasty might be going on here!";
"key_WrongFingerprintFormat" = "Either %@ has changed its host key or someone is eavesdropping on you right now (man-in-the-middle attack).\n\nCurrent Fingerprint: %@\n\nLast seen fingerprint: %@";
"key_WrongFingerprintUserCancelledFormat" = "You chose to cancel connecting to '%@'.\n\nCurrent Fingerprint: %@\n\nLast seen fingerprint: %@";
"key_KeysCreateMore" = "Create More";
"key_KeysCreated" = "Keys were created successfully!";
"key_KeysCreatedInfoFormat" = "They have been stored at '%@' and '%@'.";
"key_KeysCreatedCopiedToClipboard" = "The public key has also been copied to the clipboard!";
"key_KeysCreatedNotCopiedToClipboard" = "The public key could NOT be copied to the clipboard!";
"key_DeleteSelectedRowsFormat" = "Delete selected rows (%lu)?";
"key_More" = "More";
"key_PublicKeyExtracted" = "The public key was extracted successfully!";
"key_PrivateKeyExtracted" = "The private key was extracted successfully!";
"key_PublicKeySavedToFormat" = "It was saved to: %@";
"key_PublicKey" = "[Public Key Authentication]";
"key_SelectPrivateKey" = "Click to select a private key file for Public Key Authentication.";
"key_DisablePublicKeyFormat" = "Click to disable Public Key Authentication, current key file is '%@'";
"key_ChoosePrivateKeyFile" = "Please select a private Key File…";

"key_ConnectingToRemoteServer" = "Connecting to remote server…";
"key_RemoteCheckSuccess" = "Credentials Verified";
"key_SelectRemoteCloudFolder" = "Please select the directory where your data should be is stored…";

"key_Save" = "Save";
"key_DontSave" = "Don't Save";
"key_UnsavedChanges" = "Unsaved Changes";

"key_ErrorServerResponseTitle" = "Server Response";
"key_ConnectionProblem" = "The server could not be reached!";
"key_MaybeNoInternetOrServerDown" = "Maybe the server is down, there is no connection to the Internet or you did not provide the correct login credentials.";
"key_CouldNotConnectToServer" = "Could not connect to the server (-2)";
"key_NoConnection" = "Could not create a connection (-1)";
"key_UnsavedSettingsDiscard" = "There are some unsaved changes which will be lost. Do you want to continue?";

"key_ConObjCouldNotConnectServerPort" = "Could not connect to the remote server <%@> with the port <%@>.";
"key_ConObjCouldNotConnectUsernamePassword" = "Could not connect to the remote server with the user name <%@> and the given password/key.";
"key_ConObjCouldNotCheckConnection" = "Could not check the connection to the remote server <%@>.";
"key_ConObjCouldNotCreateDir" = "Could not create directory <%@> on remote server <%@>. Please make sure there is enough free space left and you have the proper access permissions.";
"key_ConObjCouldNotDeleteDir" = "Could not delete directory <%@> on remote server <%@>.";
"key_ConObjDirDoesNotExists" = "Could not determine if directory <%@> exists on server <%@>.";
"key_ConObjFileDoesNotExists" = "Could not determine if file <%@> exists on server <%@>.";
"key_ConObjCouldNotUploadDir" = "Could not upload the contents of this host. Please make sure there is enough free space left and you have the proper access permissions.";
"key_ConObjCouldNotDownloadFile" = "Could not download file <%@> from server <%@>.";
"key_ConObjCouldNotUploadFile" = "Could not upload file <%@> to server <%@>. Please make sure there is enough free space left and you have the proper access permissions.";
"key_ConObjCouldNotDeleteFile" = "Could not delete file <%@> from server <%@>.";
"key_ConObjCouldNotRenameFile" = "Could not rename file <%@> to <%@> on server <%@>.";
"key_ConObjCouldNotDownloadDirFormat" = "Could not download directory <%@> from remote server.";
"key_ConObjCouldNotGetPermissions" = "Could not get the access permissions of <%@> on the remote server";
"key_ConObjCouldNotChangePermissions" = "Could not change the access permissions of <%@> on the remote server";
"key_ConObjServerDoesNotSupportChangingPermissions" = "This FTP server does not seem to support changing file access permissions: %@";
"key_ConObjCouldNotFindItem" = "Could not locate the requested item <%@> on the remote server";

"key_NewFolder" = "New Folder";
"key_Create" = "Create";

"key_NewRemoteFolderName" = "Name of new remote folder:";
"key_NewFileName" = "untitled";
"key_NewFolderName" = "untitled_folder";

"key_ConfigureButton" = "Configure…";
"key_ChooseButton" = "Choose…";
"key_ProtocolTitle" = "Protocol:";
"key_ServerTitle" = "Server:";
"key_PortTitle" = "Port:";
"key_UserNameTitle" = "User Name:";
"key_PasswordTitle" = "Password:";
"key_CloudFolderTitle" = "Cloud Folder:";
"key_CloudFolderDescription" = "The \"Cloud Folder\" is where the data on the server is being stored.";
"key_Verify" = "Verify";
"key_AccountConfigurationWindowTitle" = "(S)FTP Account";
"key_AccountConfigurationTitle" = "Please configure your account…";

"key_CouldNotReadRemoteDirectory" = "The remote directory could not be read.";
"key_CouldNotReadRemoteDirectoryFormat" = "The remote directory could not be read. (%@)";
"key_PerhapsPermissionProblems" = "The directory either does not exist or is inaccessible due to insufficient access permissions. Please check your server and try again.";
"key_ConnectionProblem" = "The server could not be reached.";

"key_MampProAvailPhps" = "PHP versions available with MAMP PRO:";
"key_MampProPhpTitleFormat" = "You have selected PHP %@."; 
"key_MampProPhpMessage" = "This version, along with many others (150+), is only available for MAMP PRO."; 
